Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 224, 224, 3  0           []                               
                                )]                                                                
                                                                                                  
 conv2d_10 (Conv2D)             (None, 224, 224, 16  448         ['input_1[0][0]']                
                                )                                                                 
                                                                                                  
 conv2d_12 (Conv2D)             (None, 224, 224, 16  1216        ['input_1[0][0]']                
                                )                                                                 
                                                                                                  
 conv2d_15 (Conv2D)             (None, 224, 224, 16  448         ['input_1[0][0]']                
                                )                                                                 
                                                                                                  
 batch_normalization (BatchNorm  (None, 224, 224, 16  64         ['conv2d_10[0][0]']              
 alization)                     )                                                                 
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 224, 224, 16  64         ['conv2d_12[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 224, 224, 16  64         ['conv2d_15[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 conv2d_11 (Conv2D)             (None, 224, 224, 16  2320        ['batch_normalization[0][0]']    
                                )                                                                 
                                                                                                  
 conv2d_13 (Conv2D)             (None, 224, 224, 16  6416        ['batch_normalization_2[0][0]']  
                                )                                                                 
                                                                                                  
 conv2d_14 (Conv2D)             (None, 224, 224, 16  64          ['input_1[0][0]']                
                                )                                                                 
                                                                                                  
 conv2d_16 (Conv2D)             (None, 224, 224, 16  272         ['batch_normalization_5[0][0]']  
                                )                                                                 
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 224, 224, 16  64         ['conv2d_11[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 224, 224, 16  64         ['conv2d_13[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 224, 224, 16  64         ['conv2d_14[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 224, 224, 16  64         ['conv2d_16[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 concatenate (Concatenate)      (None, 224, 224, 64  0           ['batch_normalization_1[0][0]',  
                                )                                 'batch_normalization_3[0][0]',  
                                                                  'batch_normalization_4[0][0]',  
                                                                  'batch_normalization_6[0][0]']  
                                                                                                  
 conv2d_17 (Conv2D)             (None, 224, 224, 32  18464       ['concatenate[0][0]']            
                                )                                                                 
                                                                                                  
 conv2d_19 (Conv2D)             (None, 224, 224, 32  51232       ['concatenate[0][0]']            
                                )                                                                 
                                                                                                  
 conv2d_22 (Conv2D)             (None, 224, 224, 32  18464       ['concatenate[0][0]']            
                                )                                                                 
                                                                                                  
 batch_normalization_7 (BatchNo  (None, 224, 224, 32  128        ['conv2d_17[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_9 (BatchNo  (None, 224, 224, 32  128        ['conv2d_19[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_12 (BatchN  (None, 224, 224, 32  128        ['conv2d_22[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 conv2d_18 (Conv2D)             (None, 224, 224, 32  9248        ['batch_normalization_7[0][0]']  
                                )                                                                 
                                                                                                  
 conv2d_20 (Conv2D)             (None, 224, 224, 32  25632       ['batch_normalization_9[0][0]']  
                                )                                                                 
                                                                                                  
 conv2d_21 (Conv2D)             (None, 224, 224, 32  2080        ['concatenate[0][0]']            
                                )                                                                 
                                                                                                  
 conv2d_23 (Conv2D)             (None, 224, 224, 32  1056        ['batch_normalization_12[0][0]'] 
                                )                                                                 
                                                                                                  
 conv2d (Conv2D)                (None, 224, 224, 32  896         ['input_1[0][0]']                
                                )                                                                 
                                                                                                  
 batch_normalization_8 (BatchNo  (None, 224, 224, 32  128        ['conv2d_18[0][0]']              
 rmalization)                   )                                                                 
                                                                                                  
 batch_normalization_10 (BatchN  (None, 224, 224, 32  128        ['conv2d_20[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_11 (BatchN  (None, 224, 224, 32  128        ['conv2d_21[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_13 (BatchN  (None, 224, 224, 32  128        ['conv2d_23[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 conv2d_1 (Conv2D)              (None, 224, 224, 32  9248        ['conv2d[0][0]']                 
                                )                                                                 
                                                                                                  
 max_pooling2d_4 (MaxPooling2D)  (None, 112, 112, 32  0          ['batch_normalization_8[0][0]']  
                                )                                                                 
                                                                                                  
 max_pooling2d_5 (MaxPooling2D)  (None, 112, 112, 32  0          ['batch_normalization_10[0][0]'] 
                                )                                                                 
                                                                                                  
 max_pooling2d_6 (MaxPooling2D)  (None, 112, 112, 32  0          ['batch_normalization_11[0][0]'] 
                                )                                                                 
                                                                                                  
 max_pooling2d_7 (MaxPooling2D)  (None, 112, 112, 32  0          ['batch_normalization_13[0][0]'] 
                                )                                                                 
                                                                                                  
 max_pooling2d (MaxPooling2D)   (None, 112, 112, 32  0           ['conv2d_1[0][0]']               
                                )                                                                 
                                                                                                  
 concatenate_1 (Concatenate)    (None, 112, 112, 12  0           ['max_pooling2d_4[0][0]',        
                                8)                                'max_pooling2d_5[0][0]',        
                                                                  'max_pooling2d_6[0][0]',        
                                                                  'max_pooling2d_7[0][0]']        
                                                                                                  
 conv2d_2 (Conv2D)              (None, 112, 112, 64  18496       ['max_pooling2d[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_24 (Conv2D)             (None, 112, 112, 64  73792       ['concatenate_1[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_26 (Conv2D)             (None, 112, 112, 64  204864      ['concatenate_1[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_29 (Conv2D)             (None, 112, 112, 64  73792       ['concatenate_1[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_3 (Conv2D)              (None, 112, 112, 64  36928       ['conv2d_2[0][0]']               
                                )                                                                 
                                                                                                  
 batch_normalization_14 (BatchN  (None, 112, 112, 64  256        ['conv2d_24[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_16 (BatchN  (None, 112, 112, 64  256        ['conv2d_26[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_19 (BatchN  (None, 112, 112, 64  256        ['conv2d_29[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 max_pooling2d_1 (MaxPooling2D)  (None, 56, 56, 64)  0           ['conv2d_3[0][0]']               
                                                                                                  
 conv2d_25 (Conv2D)             (None, 112, 112, 64  36928       ['batch_normalization_14[0][0]'] 
                                )                                                                 
                                                                                                  
 conv2d_27 (Conv2D)             (None, 112, 112, 64  102464      ['batch_normalization_16[0][0]'] 
                                )                                                                 
                                                                                                  
 conv2d_28 (Conv2D)             (None, 112, 112, 64  8256        ['concatenate_1[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_30 (Conv2D)             (None, 112, 112, 64  4160        ['batch_normalization_19[0][0]'] 
                                )                                                                 
                                                                                                  
 conv2d_4 (Conv2D)              (None, 56, 56, 128)  73856       ['max_pooling2d_1[0][0]']        
                                                                                                  
 batch_normalization_15 (BatchN  (None, 112, 112, 64  256        ['conv2d_25[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_17 (BatchN  (None, 112, 112, 64  256        ['conv2d_27[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_18 (BatchN  (None, 112, 112, 64  256        ['conv2d_28[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 batch_normalization_20 (BatchN  (None, 112, 112, 64  256        ['conv2d_30[0][0]']              
 ormalization)                  )                                                                 
                                                                                                  
 conv2d_5 (Conv2D)              (None, 56, 56, 128)  147584      ['conv2d_4[0][0]']               
                                                                                                  
 max_pooling2d_8 (MaxPooling2D)  (None, 56, 56, 64)  0           ['batch_normalization_15[0][0]'] 
                                                                                                  
 max_pooling2d_9 (MaxPooling2D)  (None, 56, 56, 64)  0           ['batch_normalization_17[0][0]'] 
                                                                                                  
 max_pooling2d_10 (MaxPooling2D  (None, 56, 56, 64)  0           ['batch_normalization_18[0][0]'] 
 )                                                                                                
                                                                                                  
 max_pooling2d_11 (MaxPooling2D  (None, 56, 56, 64)  0           ['batch_normalization_20[0][0]'] 
 )                                                                                                
                                                                                                  
 max_pooling2d_2 (MaxPooling2D)  (None, 28, 28, 128)  0          ['conv2d_5[0][0]']               
                                                                                                  
 concatenate_2 (Concatenate)    (None, 56, 56, 256)  0           ['max_pooling2d_8[0][0]',        
                                                                  'max_pooling2d_9[0][0]',        
                                                                  'max_pooling2d_10[0][0]',       
                                                                  'max_pooling2d_11[0][0]']       
                                                                                                  
 conv2d_6 (Conv2D)              (None, 28, 28, 256)  295168      ['max_pooling2d_2[0][0]']        
                                                                                                  
 conv2d_31 (Conv2D)             (None, 56, 56, 128)  295040      ['concatenate_2[0][0]']          
                                                                                                  
 conv2d_33 (Conv2D)             (None, 56, 56, 128)  819328      ['concatenate_2[0][0]']          
                                                                                                  
 conv2d_36 (Conv2D)             (None, 56, 56, 128)  295040      ['concatenate_2[0][0]']          
                                                                                                  
 conv2d_7 (Conv2D)              (None, 28, 28, 256)  590080      ['conv2d_6[0][0]']               
                                                                                                  
 batch_normalization_21 (BatchN  (None, 56, 56, 128)  512        ['conv2d_31[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 batch_normalization_23 (BatchN  (None, 56, 56, 128)  512        ['conv2d_33[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 batch_normalization_26 (BatchN  (None, 56, 56, 128)  512        ['conv2d_36[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 max_pooling2d_3 (MaxPooling2D)  (None, 14, 14, 256)  0          ['conv2d_7[0][0]']               
                                                                                                  
 conv2d_32 (Conv2D)             (None, 56, 56, 128)  147584      ['batch_normalization_21[0][0]'] 
                                                                                                  
 conv2d_34 (Conv2D)             (None, 56, 56, 128)  409728      ['batch_normalization_23[0][0]'] 
                                                                                                  
 conv2d_35 (Conv2D)             (None, 56, 56, 128)  32896       ['concatenate_2[0][0]']          
                                                                                                  
 conv2d_37 (Conv2D)             (None, 56, 56, 128)  16512       ['batch_normalization_26[0][0]'] 
                                                                                                  
 conv2d_8 (Conv2D)              (None, 14, 14, 512)  1180160     ['max_pooling2d_3[0][0]']        
                                                                                                  
 batch_normalization_22 (BatchN  (None, 56, 56, 128)  512        ['conv2d_32[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 batch_normalization_24 (BatchN  (None, 56, 56, 128)  512        ['conv2d_34[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 batch_normalization_25 (BatchN  (None, 56, 56, 128)  512        ['conv2d_35[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 batch_normalization_27 (BatchN  (None, 56, 56, 128)  512        ['conv2d_37[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 conv2d_9 (Conv2D)              (None, 14, 14, 512)  2359808     ['conv2d_8[0][0]']               
                                                                                                  
 max_pooling2d_12 (MaxPooling2D  (None, 28, 28, 128)  0          ['batch_normalization_22[0][0]'] 
 )                                                                                                
                                                                                                  
 max_pooling2d_13 (MaxPooling2D  (None, 28, 28, 128)  0          ['batch_normalization_24[0][0]'] 
 )                                                                                                
                                                                                                  
 max_pooling2d_14 (MaxPooling2D  (None, 28, 28, 128)  0          ['batch_normalization_25[0][0]'] 
 )                                                                                                
                                                                                                  
 max_pooling2d_15 (MaxPooling2D  (None, 28, 28, 128)  0          ['batch_normalization_27[0][0]'] 
 )                                                                                                
                                                                                                  
 conv2d_transpose (Conv2DTransp  (None, 28, 28, 256)  524544     ['conv2d_9[0][0]']               
 ose)                                                                                             
                                                                                                  
 concatenate_3 (Concatenate)    (None, 28, 28, 512)  0           ['max_pooling2d_12[0][0]',       
                                                                  'max_pooling2d_13[0][0]',       
                                                                  'max_pooling2d_14[0][0]',       
                                                                  'max_pooling2d_15[0][0]']       
                                                                                                  
 concatenate_4 (Concatenate)    (None, 28, 28, 1024  0           ['conv2d_transpose[0][0]',       
                                )                                 'conv2d_7[0][0]',               
                                                                  'concatenate_3[0][0]']          
                                                                                                  
 conv2d_38 (Conv2D)             (None, 28, 28, 256)  2359552     ['concatenate_4[0][0]']          
                                                                                                  
 conv2d_39 (Conv2D)             (None, 28, 28, 256)  590080      ['conv2d_38[0][0]']              
                                                                                                  
 conv2d_transpose_1 (Conv2DTran  (None, 56, 56, 128)  131200     ['conv2d_39[0][0]']              
 spose)                                                                                           
                                                                                                  
 concatenate_5 (Concatenate)    (None, 56, 56, 512)  0           ['conv2d_transpose_1[0][0]',     
                                                                  'conv2d_5[0][0]',               
                                                                  'concatenate_2[0][0]']          
                                                                                                  
 conv2d_40 (Conv2D)             (None, 56, 56, 128)  589952      ['concatenate_5[0][0]']          
                                                                                                  
 conv2d_41 (Conv2D)             (None, 56, 56, 128)  147584      ['conv2d_40[0][0]']              
                                                                                                  
 conv2d_transpose_2 (Conv2DTran  (None, 112, 112, 64  32832      ['conv2d_41[0][0]']              
 spose)                         )                                                                 
                                                                                                  
 concatenate_6 (Concatenate)    (None, 112, 112, 25  0           ['conv2d_transpose_2[0][0]',     
                                6)                                'conv2d_3[0][0]',               
                                                                  'concatenate_1[0][0]']          
                                                                                                  
 conv2d_42 (Conv2D)             (None, 112, 112, 64  147520      ['concatenate_6[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_43 (Conv2D)             (None, 112, 112, 64  36928       ['conv2d_42[0][0]']              
                                )                                                                 
                                                                                                  
 conv2d_transpose_3 (Conv2DTran  (None, 224, 224, 32  8224       ['conv2d_43[0][0]']              
 spose)                         )                                                                 
                                                                                                  
 concatenate_7 (Concatenate)    (None, 224, 224, 12  0           ['conv2d_transpose_3[0][0]',     
                                8)                                'conv2d_1[0][0]',               
                                                                  'concatenate[0][0]']            
                                                                                                  
 conv2d_44 (Conv2D)             (None, 224, 224, 32  36896       ['concatenate_7[0][0]']          
                                )                                                                 
                                                                                                  
 conv2d_45 (Conv2D)             (None, 224, 224, 32  9248        ['conv2d_44[0][0]']              
                                )                                                                 
                                                                                                  
 conv2d_46 (Conv2D)             (None, 224, 224, 1)  33          ['conv2d_45[0][0]']              
                                                                                                  
==================================================================================================
Total params: 11,991,281
Trainable params: 11,987,921
Non-trainable params: 3,360
__________________________________________________________________________________________________
None
